Autodesk.Revit.DB.ATFGeometrySerializationOptions.GetIdConverter
Get the Id Converter used for resolving Element references within the serialized data

Autodesk.Revit.DB.ATFGeometrySerializationOptions.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ATFGeometrySerializationOptions.ElementId
The Id of the Element to be serialized.

Autodesk.Revit.DB.ATFGeometrySerializationOptions
The options used when serializing geometry to binary format.